import csv

from selenium import webdriver
from selenium.webdriver.chrome.options import Options
from selenium.webdriver.common.by import By
from selenium.webdriver.support import expected_conditions as EC
from selenium.webdriver.support.wait import WebDriverWait
from lxml import etree
import pandas as pd
import time
import random


class AlibabaBought:
    '''
    抓取个人淘宝订单的已购买的订单
    '''

    url = 'https://www.taobao.com'
    mytaobao_xpath = '//*[@id="J_SiteNavMytaobao"]/div[1]/a'
    bought_xpath = '//*[@id="bought"]'
    page_xpath = '//*[@id="tp-bought-root"]/div[54]/div[2]/ul/li[@class="pagination-next"]'


    date_list = []
    order_list = []
    title_list = []
    shop_list = []
    num_list = []
    price_list = []
    statecode_list = []
    unit_price_list = []

    total_list = []

    def __init__(self):

        '''
        实例化的时候自动设置浏览器的参数
        '''
        chrome_options = Options()
        chrome_options.add_argument('--window-size=1500,1366')
        self.browser = webdriver.Chrome(chrome_options=chrome_options, executable_path=r"F:\google\chromedriver.exe")

    def click_case(self, my_xpath):

        '''
        点击事件
        '''

        button = WebDriverWait(self.browser, 20).until(
            EC.element_to_be_clickable(
                (By.XPATH, my_xpath))
        )
        button.click()

    def click_mytaobao(self):
        '''
        打开需要访问的网站,点击我的淘宝
        '''

        self.browser.get(self.url)
        self.click_case(my_xpath=self.mytaobao_xpath)

    # 扫码登录
    def click_bought(self):
        '''
        点击已买到的宝贝
        '''
        self.click_case(self.bought_xpath)

    def click_next_page(self):
        '''
        点击下一页
        '''
        self.click_case(self.page_xpath)

    def analysis_web(self, order_list_xpath, order_list):
        '''解析网页源代码'''
        page_taobao_html = self.browser.page_source
        my_data = etree.HTML(page_taobao_html).xpath(order_list_xpath)
        print(my_data)
        order_list.append(my_data)
        # print(my_data[0])
        print('-' * 100)

    def make_data_xpath(self):
        '''构造订单信息的xpath路径并解析源码保存到列表中'''
        for i in range(4, 54):
            date_xpath= '//*[@id="tp-bought-root"]/div[%s]/div/table/tbody[1]/tr/td[1]/label/span[2]/text()' % i
            # order_xpath= '//*[@id="tp-bought-root"]/div[%s]/div/table/tbody[1]/tr/td[1]/span/span[3]/text()' % i
            title_path = '//*[@id="tp-bought-root"]/div[%s]/div/table/tbody[2]/tr/td[1]/div/div[2]/p[1]/a/span[2]/text()' % i
            # shop_path= '//*[@id="tp-bought-root"]/div[%s]/div/table/tbody[1]/tr/td[2]/span/a/text()' % i
            num_path = '//*[@id="tp-bought-root"]/div[%s]/div/table/tbody[2]/tr/td[3]/div/p/text()' % i
            price_path = '//*[@id="tp-bought-root"]/div[%s]/div/table/tbody[2]/tr/td[5]/div/div[1]/p/strong/span[2]/text()' % i
            # statecode_path= '//*[@id="tp-bought-root"]/div[%s]/div/table/tbody[2]/tr/td[6]/div/p/span/text()' % i
            unit_price_path = '//*[@id="tp-bought-root"]/div[%s]/div/table/tbody[2]/tr/td[2]/div/p/span[2]/text()' % i
            try:
                self.analysis_web(date_xpath, self.date_list)
                # self.analysis_web(order_xpath, self.order_list)
                self.analysis_web(title_path, self.title_list)
                # self.analysis_web(shop_path, self.shop_list)
                self.analysis_web(num_path, self.num_list)
                self.analysis_web(price_path, self.price_list)
                # self.analysis_web(statecode_path, self.statecode_list)
                self.analysis_web(unit_price_path, self.unit_price_list)
            except Exception:
                break


    def save_date(self):
        '''保存到指定路径下面为excel'''

        print(self.title_list)
        print(self.unit_price_list)
        print(self.price_list)
        print(self.num_list)
        print(self.date_list)

        with open('taobao.csv', 'a', encoding='utf-8', newline='') as f:
            writer = csv.writer(f)
            writer.writerow(["title", "price", "num", 'total_price'])
            for i in range(0, len(self.price_list)):
                if self.price_list[i] == []:
                    break
                else:
                    for j in range(0, len(self.unit_price_list[i])):
                        if self.title_list[i][j] == '保险服务':
                            continue
                        else:
                            writer.writerow([self.title_list[i][j], self.unit_price_list[i][j], self.num_list[i][j]])
                    writer.writerow(['', '', self.date_list[i][0], self.price_list[i][0]])

    def run(self):
        self.click_mytaobao()
        self.click_bought()

        while True:
            self.make_data_xpath()

            is_go_on = int(input("继续抓取请输入 1 ；退出请输入 2："))
            if is_go_on == 1:
                self.click_next_page()
                time.sleep(random.uniform(3, 5))
            elif is_go_on == 2:
                self.browser.close()
                break
        self.save_date()

def main():
    alibaba_bought = AlibabaBought()
    alibaba_bought.run()

if __name__== '__main__':
    main()


# -*- coding: utf-8 -*- 1
import csv

# title_list = [['【芭芭农场助农兑换】源生鲜安岳青柠檬3斤装当季新鲜时令水果'], ['金纺柔顺剂衣物护理液防静电', '汰渍整箱批香味持久袋装洗衣液'], ['美国contigo儿童吸管杯ppsu'], ['益生菌漱口水杀菌除口臭持久留香牙结石涑遬簌男女生便携装一次性', '保险服务'], ['【加厚碳素钢】笔记本电脑支架桌面立式便携式金属托架调节颈椎办公升降悬空底座散热器适用于华为苹果荣耀', '保险服务'], ['妮维雅氨基酸洗面奶深层清洁美白泡沫洁面乳补水保湿洁面150g'], ['琼南椰香椰子油食用油1000ml冷肤'], ['100年润发官方正品精油'], ['美白就用它 超5W爱白妹亲测推荐', 'Dove多芬身体磨砂膏保湿'], ['卡片笔记写作法 如何实现从阅读到写作 结构化写作 学会写作15+', '高质量读研如何写论人邮', '单核工作法图解 拖延变高效 番茄工作法图解 姊妹篇 时间管理', '从一个点子到商业传奇'], ['funnyelves方里底妆礼盒粉饼', '保险服务'], ['当当网正版书籍三体全集3册', '这就是理科写作'], ['【官方补贴】驾考宝典驾校一点通vip半年会员直充全科目一二三四'], ['寡肽原液30ml去淡化痘印痘疤冻干粉祛痘护肤品面部修复精华液男女', '熊果苷亮肤原液500ml面部保湿补水收缩毛孔提亮肤色嫩肤oem代加工', '原液升级版保湿重拾活力光彩精华', '积雪草纯露提取物精华收缩毛孔', '左旋vc原液淡班祛斑改善暗沉提亮肤色水光维c嫩白亮肤精华液正品'], ['儿童睡前故事书绘本全套0-3一6岁幼儿园带拼音的图画童话益智婴幼儿启蒙早教大全小书本宝宝婴儿图书会2两三1阅读亲子读', '【11册】写给孩子有趣的中国历史百科绘本 我们的历史幼儿趣味版正版小学生课外书中华上下五千年漫画儿童历史书籍故事少年'], ['Colab pro升级月费会员谷歌云盘扩容订阅 goole one colabpro'], ['100年润发官方正品精油'], ['60支莫代尔3A级艾草抗菌超柔舒适', '60支莫代尔3A级艾草抗菌超柔舒适'], ['薄款内衣无钢圈上托防垂少女bra', '保险服务'], ['壬二酸祛痘凝胶和甲硝唑凝胶药膏甲硝锉软膏百分之15%任二酸mf'], ['左旋vc原液淡班祛斑改善暗沉提亮肤色水光维c嫩白亮肤精华液正品', '熊果苷亮肤原液500ml面部保湿补水收缩毛孔提亮肤色嫩肤oem代加工', '寡肽原液30ml去淡化痘印痘疤冻干粉祛痘护肤品面部修复精华液男女', '原液升级版保湿重拾活力光彩精华', '积雪草纯露提取物精华收缩毛孔'], ['蓝牙耳机无线女生款适用苹果oppo华为vivo小米2021年新款高颜值女士款可爱卡通男款高端降噪半入耳式运动游戏', '保险服务'], ['网上打印服务复印彩色黑白激光文本打印资料书本装订数码快印印刷'], ['现货 备考2023王道计算机考研全套4本 2022年数据结构操作系统计算机网络组成原理408专业基础综合考试历年真题'], ['二手新编数据库原理习题与解析 李春葆送电子PDF笔记真题模拟题库'], ['【跨年狂欢】柏氏砰砰玻尿酸原液精华液面部收缩毛孔补水保湿化妆品旗舰店正品', '保险服务'], ['【跨年狂欢】柏氏砰砰玻尿酸原液精华液面部收缩毛孔补水保湿化妆品旗舰店正品', '保险服务'], ['【跨年狂欢】奥康假两件爸爸毛衣加绒加厚中老年男士冬装针织打底衫精工内搭款', '保险服务'], ['康中医氯己定含漱液复方漱口水110毫升牙龈牙周口气清新抑菌防蛀', '爱齿伴侣高拉力牙线棒剔牙去牙垢牙线签50支*6盒出口级牙线安全'], ['完美日记桃金四合院盘国家地理十六色眼影盘哑光珠光', '保险服务'], ['雀巢脆脆鲨巧克力味威化促销装(24+8)条640g花生/牛奶味饼干零食', '保险服务'], ['【狂欢价】2021新款交叉小围巾女生冬季韩版百搭仿兔毛围脖加厚保暖毛绒时尚', '保险服务'], ['【狂欢价】棉拖鞋女冬家用防滑可爱室内居家宿舍毛绒情侣拖鞋男冬季2021新款', '保险服务'], ['卧龙手工老灶麻辣味锅巴400g*4大份量囤货休闲零食老襄阳花椒锅巴', '保险服务'], ['【狂欢价】真颜分子jeayfeaz素颜霜裸妆提亮肤色滋润保湿懒人霜学生女正品', '保险服务'], ['【狂欢价】今晚0点开抢】Mistine小黄帽防晒霜乳泰版防紫外线学生隔离女秋冬', '【赠品】Mistine身体磨砂膏软化角质鸡皮海盐毛囊深层清洁蜜丝婷', '保险服务'], ['自然堂面膜60片喜马拉雅补水保湿紧致抗皱控油收缩毛孔专柜正品女', '保险服务'], ['【狂欢价】今晚0点开抢】Mistine小黄帽防晒霜乳泰版防紫外线学生隔离女秋冬', '【赠品】Mistine身体磨砂膏软化角质鸡皮海盐毛囊深层清洁蜜丝婷', '保险服务'], ['现货速发 肖四肖八2022肖秀荣考研政治冲刺8套卷 +肖秀荣预测4套卷 考试模拟押题习题卷肖秀荣考研政治肖4肖8试题', '保险服务'], ['【狂欢价】睡衣女2021年新款秋冬季珊瑚绒加厚加绒可爱冬款女士法兰绒家居服', '保险服务'], ['耐克Nike原装鞋垫适配AF1空军一号AJ1篮球运动跑步zoom高弹减震男', '保险服务'], ['无孔皮带女简约百搭韩国网红ins风韩版时尚黑色牛仔裤腰带女装饰'], ['睡衣女2021年新款秋冬季珊瑚绒加厚加绒可爱冬款女士法兰绒家居服', '保险服务'], ['德国THERMOS 膳魔师便携简约不锈钢车载男女保温杯500ml水杯杯子', '保险服务'], ['发声有声挂图看图识字认知语音启蒙早教卡片墙贴宝宝儿童玩具2岁'], ['帆布共和国2021新款双肩包女男背包大容量简约时尚百搭撞色书包潮', '保险服务'], ['【划算价】雪玲妃氨基酸泡沫洗面奶洁面乳慕斯男女士控油皮专用官方正品学生', '保险服务'], ['凡士林大粉瓶身体乳补水维他亮肤修护润肤露B3烟酰胺滋润', 'Vaseline凡士林修护晶冻护手霜唇膏唇膜淡化唇纹50ml/瓶保湿补水'], ['Dickies手表女2021年新款潮流时尚硅胶女石英学生可爱糖果色手表', '保险服务'], ['ZARA新款 女士APPLEJUICE + WHITE JASMINE香水100ML 20047918999'], ['【芭芭农场】喜盈盈膨化虾条薯条棒冰混装零食礼盒'], ['敷益清冰感舒缓水光修护贴 冰膜 镇定舒缓补水保湿晒后修护学生用', '敷益清冰膜1盒 赠品链接', '敷益清冰膜2片赠品'], ['敷益清冰感舒缓水光修护贴 冰膜 镇定舒缓补水保湿晒后修护学生用', '敷益清冰膜1盒 赠品链接', '敷益清冰膜2片赠品'], ['魅可MAC口红子弹头316 唇膏小辣椒923#646#ruby woo#820 新色925'], ['酷盐系背带裤女春秋港味韩版宽松可爱日系小个子直筒九分牛仔裤子', '保险服务'], ['专拍Hgy'], ['中国扶贫基金会 爱加餐 爱心餐营养加餐 公益餐 捐款捐赠'], ['【免费刻字】u盘128g大容量手机电脑两用U盘华为手机typec高速创意双用汽车车载正品优盘定制可爱女生', '保险服务'], ['2022肖秀荣考研政治精讲精练肖秀荣1000题肖秀荣2022'], ['韩国东大门高级感套装耳钉2021年新款潮组合耳饰气质小巧精致耳环'], ['2022天勤论坛殷人昆高分笔记数据结构王道论坛操作系统'], ['英语六级真题试卷2021年大学cet考试历年详解6级备考复习资料全套阅读理解词汇书单词乱序版火星四六级听力翻译专项训'], ['zara法国小众剑桥包2021新款压花设计斜挎包女小包高级感百搭包包'], ['算法笔记'], ['程序设计与C语言(第3版)上机实验915梁力西安交通大学出版非卖品', '保险服务'], ['戴尔Inspiron灵越5570 5576 5577 5370笔记本内存8G 4G DDR4 2400', '保险服务'], ['夹心海苔宝宝儿童小孩健康零食海苔脆片孕妇夹心脆芝麻巴旦木2罐', '婴幼儿手指饼干宝宝辅食无添加食盐儿童磨牙零食6-12月1-2-3岁', '保险服务'], ['官方直充 超快充 自动充值 即时到账 山西联通话费快充20元'], ['PURID朴理3号精华创研修护臻采精华液30ml视黄醇抗初老抚褪纹理', 'PURID朴理沁透光感精华露377VC面部精华焕亮御氧均净肤色'], ['套餐内容见页面说明】喜辽妥 多磺酸粘多糖乳膏 14g*1支/盒 正品 软膏药膏 皮肤外用', '芙原 积雪苷霜软膏 2.5%*20g*1支/盒 积雪草苷霜软膏 正品 疤痕疙瘩淡化 创伤愈合外伤手术创伤烧伤 积雪苷'], ['英国Aussie袋鼠三分钟奇迹发膜深层护发改善损伤干枯修复多款可选', '保险服务'], ['二手Hadoop大数据技术开发实战张伟洋著9787302534020'], ['数字图像处理技术与应用第2版 韩晓军 电子工业出版社 9787121300'], ['山西移动 手机 话费充值 20元 快充直充24小时自动充值快速到帐'], ['【38活动价】现货速发【送同济试卷+易错题】2022李永乐线性代数辅导讲义 数学一数二数三考研数学教材线代讲义可搭张', '【38活动价】现货【送真题+视频】2022李永乐考研数学二660题 王式安考研数学 武忠祥基础过关660题 数二考研', '保险服务'], ['【38活动价】摩洛哥护发精油免洗女香味持久留香改善毛躁卷头发修复防分叉干枯', '【38活动价】馥佩洗发水去屑止痒控油蓬松改善毛躁洗发露沐浴套装正品官方品牌', '保险服务'], ['新版【赠全套视频】新东方恋练有词2022考研英语词汇 恋恋有词考研词汇考研英语一历年真题单词书英语二 配念念有词张剑'], ['安耐晒安热沙防晒霜女面部男脸部金管日本anessa安奈乳小金瓶60ml'], ['春秋2021新款修身直筒八分黑色牛仔裤女高腰显瘦复古九分简约女神', '保险服务'], ['飞利浦电动牙刷HX6730 HX6761成人充电式声波震动智能净白男女款', '保险服务'], ['山西联通话费30元 手机充值 自动快充'], ['山西联通话费30元 手机充值 自动快充'], ['日本版cpb新款黑长管隔离霜妆前乳遮瑕持久保湿补水滋润光感控油'], ['山西移动 手机 话费充值 20元 快充直充24小时 自动充值 快速到帐'], ['纽西之谜清洁泥膜面膜深层补水保湿收缩毛孔纽西兰之谜旗舰店官网', '保险服务'], ['珀莱雅解渴面膜涂抹睡眠面膜清洁泥膜免洗式面膜修护补水保湿提亮', '保险服务'], ['新版2022年王道计算机考研数据结构考研复习指导计算机408考研教材可搭操作系统计算机网络组成原理天勤2022高分笔', '保险服务'], ['【年货价】【??现货速发 赠视频】2022汤家凤1800数二1800题数学二2022考研数学二汤家凤数学二1800题', '保险服务'], ['鑫炳记红枣味原味太谷饼2100g整箱山西特产早餐食品点心传统糕点', '保险服务'], ['鑫炳记红枣味原味太谷饼2100g整箱山西特产早餐食品点心传统糕点', '保险服务'], ['宝宝餐椅儿童餐桌椅子便携可折叠bb凳多功能吃饭座椅婴儿实木饭桌', '保险服务'], ['【自动充值】哔哩哔哩大会员bilibili B站一个月会员 月度大VIP1'], ['幼儿童玩具数字拼图积木早教益智力开发动脑1-2岁半3男孩女孩宝宝', '保险服务'], ['哔哩哔哩大会员 月度b站大会员 bilibili大会员1个月vip非激活码'], ['精选柠檬片500g包邮 泡茶干片泡水干柠檬片水果茶散装袋装花茶', '保险服务'], ['睿盈暖贴宝宝贴自发热100片保暖身贴宫暖宝贴女宫寒贴正品足热帖'], ['山西移动 手机 话费充值 20元 快充直充24小时 自动充值 快速到帐'], ['【美食价】鑫炳记红枣味原味太谷饼2100g整箱山西特产早餐食品点心传统糕点', '【美食价】鑫炳记石头饼1000g手工石子馍批发零食小吃 休闲食品散装 一箱', '保险服务'], ['健儿乐宝宝饼干蔬菜动物造型儿童零食无添加白砂糖盐非婴儿辅食', '伴宝士婴幼儿童手指饼干宝宝辅食无添加盐磨牙零食6-12月1-2-3岁', '保险服务'], ['爱茜玛凡士林身体乳女保湿滋润补水润肤霜露全身香体润体乳护手霜', '保险服务'], ['pandaw潘达玻尿酸二裂酵母安瓶精华液面部精华收缩毛孔补水保湿', 'pandaw潘达玻尿酸二裂酵母安瓶精华液面部精华收缩毛孔补水保湿', '保险服务'], ['romand唇釉口红女学生款平价李佳琪推荐小众品牌土砖色冰糖山楂色'], ['unifree婴儿棉柔巾一次性洗脸巾女干湿两用宝宝专用非湿巾60抽', '保险服务'], ['【狂欢价】【亏本包邮】美妆蛋 海绵粉扑斜切水滴葫芦 化妆蛋彩妆蛋干湿两用', '保险服务'], ['【狂欢价】嘉利玛虾青素粉底液膏女养肤遮瑕保湿持久轻薄裸妆bb霜抗防不暗沉', '保险服务'], ['essence香蕉粉饼控油定妆遮瑕持久德国essence干粉蜜粉防水定妆粉', '【赠品勿拍】艾森丝甜心柔软蓬松颊彩刷', '保险服务'], ['【狂欢价】【立即抢购】WIS水润面膜补水保湿玻尿酸清洁收缩毛孔淡痘印男女', '保险服务'], ['联想无线蓝牙耳机颈挂脖式运动型跑步超长待机续航头戴式单双耳防水入耳挂耳塞苹果安卓华为小米vivo通用游戏', '保险服务'], ['秋冬黑色加绒高腰牛仔裤女直筒宽松浅色烟管裤九分显瘦小个子阔腿', '保险服务'], ['全棉时代奈丝公主超净吸卫生巾纯棉表层超薄日夜用姨妈巾63片装'], ['官方直充 超快充 自动充值 即时到账 山西联通话费快充50元'], ['山西移动 手机 话费充值 100元 快充直充24小时自动充值快速到帐'], ['山西移动 手机 话费充值 30元 快充直充24小时 自动充值 快速到帐'], ['甜酸白色五角星925银针耳钉简约冷淡风耳环女气质韩国个性防过敏', '花朵夏天的耳环清新百搭ins耳饰品2020新款潮小雏菊耳钉女925银针', '甜酸小蝴蝶结耳骨钉925银针耳环2020年新款潮气质个性百搭耳饰'], ['水密码补水保湿玻尿酸面膜贴女学生美白淡斑收缩毛孔男士睡眠免洗', '保险服务'], ['山西移动 手机 话费充值 50元 快充直充24小时 自动充值 快速到帐'], ['二手数值分析第五版5版李庆扬清华大学出版社'], ['JAYJUN捷俊水光蜂蜜面膜套装15片 韩国补水保湿滋养修护面膜贴女'], ['完美日记眼影盘动物十二色锦鲤小猫小狗小猪熊猫斑虎李佳琪推荐', '保险服务'], ['【99划算价】正品潘婷3分钟三分钟奇迹发膜 女修护干枯柔顺护理改善毛躁精华霜', '保险服务'], ['我睡着了  原创图案 想象中的样子 黑色T恤加黑色熊印花 超爱自穿'], ['3包洗脸巾女一次性纯棉加厚洗面卸妆棉无菌洁面巾纸擦脸巾抽取式', '保险服务'], ['薄款舒适莫代尔棉无钢圈康后内衣女夏季无痕光面轻薄透气少女文胸', '薄款舒适莫代尔棉无钢圈康后内衣女夏季无痕光面轻薄透气少女文胸', '保险服务'], ['耐克Nike Air Force 1 AF1空军一号纯白中帮低帮 男女休闲板鞋'], ['韩国纯棉睡衣春秋日系家居服可爱卡通番茄仔少女软妹纯棉长袖长裤'], ['山西移动 手机 话费充值 50元 快充直充24小时自动充值快速到帐'], ['Dove多芬身体沐浴磨砂膏滋润去死皮鸡皮角质红石榴奇异果大瓶298g', '夏天清爽变白!!Olay玉兰油莹亮身体乳 B3烟酰胺+vc only 香氛保湿'], ['欧莱雅护发精油奇焕润发卷发修复干枯受损毛躁免洗官方旗舰店正品'], ['山西联通话费 50元快充 自动充值 手机充值 即时到帐 快充'], ['【88狂欢价】卧龙手工小麻花袋装休闲食品整箱糕点酥脆怀旧咪特产夜宵零食小吃', '【88狂欢价】卧龙手工老灶麻辣味锅巴400g*4大份量二阳休闲零食老襄阳特产锅巴', '保险服务'], ['【88狂欢价】森马长袖衬衫女2020秋季新款纯色韩版宽松衬衣学生设计感小众上衣', '保险服务'], ['【88狂欢价】Cache Cache条纹T恤套装女2020新款夏季洋气减龄背带短裤两件套潮', '保险服务'], ['山西移动 手机 话费充值 20元 快充直充24小时自动充值快速到帐'], ['官方超快充—山西联通20元手机话费充值'], ['山西移动 手机 话费充值 20元 快充直充24小时自动充值快速到帐'], ['山西移动 手机 话费充值 20元 快充直充24小时自动充值快速到帐'], ['山西联通20元 联通话费 自动充值 直充快充 快速到账'], ['山西移动 手机 话费充值 20元 快充直充24小时自动充值快速到帐'], ['山西移动 手机 话费充值 20元 快充直充24小时自动充值快速到帐'], ['【狂欢价】充电式无线蓝牙双模鼠标办公静音笔记本电脑无限女生可爱超薄滑鼠可苹果联想华硕小米微软通用非电池无声mac', '实物赠品1（收藏加购送一张圆形布艺鼠标垫20*20cm，款式随机发）', '保险服务'], ['山西移动 手机 话费充值 20元 快充直充24小时自动充值快速到帐'], ['山西移动 手机 话费充值 20元 快充直充24小时自动充值快速到帐'], ['现货大学英语六级真题试卷备考2020年6月含2019年12月真题英语六级听力改革新题型CET6六级英语真题试卷备考资'], ['山西联通20元官方快充 手机充值话费 联通全自动充值 即时到帐'], ['山西移动 手机 话费充值 20元 快充直充24小时自动充值快速到帐'], ['统计机器学习导论'], ['韩国ins超火街拍李圣经同款皮面小白鞋chic百搭学生休闲板鞋女潮'], ['金大班静念2020春季新款中性bf风刺绣圆领拼接假两件卫衣上衣少女'], ['山西联通20元 手机话费充值 自动快充'], ['山西移动 手机 话费充值 20元 快充直充24小时自动充值快速到帐'], ['藤本月季欧月玫瑰爬藤蔷薇花苗植物花卉多季开花盆栽耐寒耐热花卉', '藤本月季欧月玫瑰爬藤蔷薇花苗植物花卉多季开花盆栽耐寒耐热花卉', '藤本月季欧月玫瑰爬藤蔷薇花苗植物花卉多季开花盆栽耐寒耐热花卉'], ['大菊花苗带花苞花卉观花绿植物室内外庭院阳台盆栽千头菊四季开花', '大菊花苗带花苞花卉观花绿植物室内外庭院阳台盆栽千头菊四季开花'], ['【品智价】自拍杆三脚架拍照神器通用型直播支架无线蓝牙一体式自排干棒加长带遥控器懒人适用苹果8p小米华为手机xr网红', '保险服务'], ['【38活动价】睿盈暖贴宝宝贴自发热100片保暖身贴宫暖宝贴女宫寒贴正品足热帖', '保险服务'], ['中年毛衣妇女四五十岁妈妈宽松洋气时尚休闲打底衫加厚内搭秋冬季', '保险服务'], ['山西移动 手机 话费充值 30元 快充直充24小时自动充值快速到帐'], ['山西联通话费20元自动充值 官方快充'], ['足力健老人鞋女官方旗舰店官网正品张凯丽冬季加绒健步保暖款棉鞋', '保险服务'], ['【正版】数据产品经理修炼手册 从零基础到大数据产品实践 数据产品经理入门教程书籍 互联网产品经理项目管理开发设计运营', '【赠品】好学卡 百门好课限时免费学'], ['山西联通20元 手机话费充值 自动快充'], ['山西移动 手机 话费充值 20元 快充直充24小时自动充值快速到帐'], ['冬季外套羽绒棉服女2019新款韩版宽松长款过膝棉袄学生加厚棉衣冬'], ['舒莱姨妈巾 透气派5包60片瞬吸绵面日夜组合装卫生巾女批发整箱', '保险服务'], ['德国Balea芭乐雅喷雾 蓝藻控油清爽脸部定妆保湿爽肤水舒缓补水女', '保险服务'], ['婴儿帽子秋冬婴幼儿0-6个月3纯棉可爱新生女宝宝毛线帽儿童男1岁2', '保险服务'], ['【双11狂欢价】婴儿袜子秋冬季纯棉宝宝儿童地板防滑加厚加绒新生儿长筒学步鞋袜', '保险服务'], ['【闪电发货】山西联通话费充值20元自动快充'], ['《少年的你》山西剧院(VR激光影院)电影票'], ['牛仔裤女宽松秋冬2019新款白色直筒裤高腰显瘦港味复古网红老爹裤'], ['韩版chic圣诞彩虹条纹圆领套头毛衣女打底宽松秋栋2019甜美慵懒风', '保险服务'], ['小石榴666 Verbena Linn烟酰胺香氛沐浴露婴童标准香水沐浴乳持久', '保险服务'], ['台灯护眼书桌小学生可充电插电两用台风宿舍夹子式卧室用led床头', '增值服务：家装三年质保'], ['VANS权志龙 AUT OS Era SK8-Hi Slip-on棋盘黑白红格高低帮帆布鞋'], ['【闪电发货】山西移动话费充值100元自动快充'], ['觅定法式方领泡泡袖上衣女短款设计感小众复古格子衬衫娃娃衫韩版'], ['山西移动话费 100元快充 自动充值 手机充值 即时到帐 快充'], ['山西移动话费 100元快充 自动充值 手机充值 即时到帐 快充'], ['ALL JOINT大容量儿童男独角兽保温杯便携水杯幼儿园带吸管水壶女'], ['手机直播支架拍照三脚架蓝牙遥控多功能录视频拍摄自拍三角架夹户外折叠便携摄影设备支撑架杆补光灯落地式', '保险服务'], ['山西移动 手机 话费充值 30元 快充直充24小时自动充值快速到帐'], ['山西移动30元快充 手机话费充值卡直充交费 全球通动感地带神州行'], ['山西移动 手机 话费充值 50元 快充直充24小时自动充值快速到帐'], ['【活动价】【满铺】靖江特产散装猪肉脯168g*2袋 麻辣蜜汁特产零食肉铺干', '保险服务'], ['满铺芒果干500g大袋一箱装批发散装整箱水果干零食小吃休闲食品', '【满铺】靖江特产散装猪肉脯168g*2袋 麻辣蜜汁特产零食肉铺干', '保险服务'], ['温和卸妆水按压瓶脸部深层清洁无刺激正品学生卸妆油眼唇卸妆液女', '保险服务'], ['山西移动 手机 话费充值 100元 快充直充24小时自动充值快速到帐'], ['山西移动话费 100元快充 自动充值 手机充值 即时到帐 快充'], ['山西移动 手机 话费充值 100元 快充直充24小时自动充值快速到帐'], ['3本装优惠包邮日本KOKUYO国誉中高小学生用设计学习本方格空白音乐英语作文笔记本全科目备注本A5/B5记事笔录'], ['【4卷装】蒙丽丝一次性洗脸巾女纯棉柔洁面巾纸美容专用巾卷筒式'], ['【国潮价】MMH多肉植物组合新手套餐肉肉多肉花植物含白瓷花盆花卉盆栽包邮'], ['山西移动 手机 话费充值 50元 快充直充24小时自动充值快速到帐'], ['抖音台湾绿贝水壶大容量ins风网红吸管杯便携运动少女大人水杯子', '保险服务'], ['西门大嫂 日本 RAFRA防晒喷雾 橘子味 清爽不油腻 Just Chilling', '西门大嫂 法国理肤泉大哥大轻盈防晒乳液50mlSPF50 Just Chilling'], ['Web安全深度剖析 web渗透安全 web安全测试 白帽子讲web安全 漏洞战争 计算机网络安全技术书籍 Web网站'], ['卡通眼罩套装 男女童趣卡通印花单面真丝眼罩收纳袋 礼物包邮'], ['100片 洗脸巾女洁面巾纯棉一次性洗面巾纸抽取式擦脸巾美容院专用', '保险服务'], ['寻荟记芦荟椰油氨基酸洗面奶洁面泡沫慕斯温和洁净清爽不紧绷男女', '保险服务'], ['小迷糊玻尿酸黑面膜补水保湿亮肤清洁提亮肤色面膜贴21片男女学生', '保险服务'], ['奥妙洗衣液 全自动含金纺馨香精华深层洁净 淡雅樱花 3KG/瓶'], ['伊·蚨秋冬条绒灯芯绒女裤宽松休闲裤萝卜裤女长裤显瘦小脚哈伦裤', '保险服务'], ['衣品乐原创大码拼色连帽卫衣女韩版宽松2019新款春装休闲上衣T054'], ['colourpop唇釉colorpop vitamin sea know it all halo effect', '保险服务'], ['苏菲卫生巾女整箱批发日夜用290超熟睡420姨妈巾组合装旗舰店官网', '保险服务'], ['笔记本电脑桌床上书桌可折叠学生宿舍写字小桌板寝室用懒人小桌子'], ['寻荟记芦荟胶祛痘淡化痘印膏凝胶补水保湿晒后修复面霜护肤品男女', '保险服务'], ['爱好按动中性笔0.5mm黑色/墨蓝/蓝色/红色子弹头水性笔签字笔医生处方笔办公用品包邮批发489', '保险服务'], ['包邮小林制药日本原装内衣内裤洗液洗衣液120ml清洗剂去血渍污渍'], ['【第2件半价】海昌ClearEasy半年抛1片高清近视透明隐形眼镜', '海昌官方旗舰店SPA保湿多效极润500+120ml水润舒适隐形眼镜护理液', '海昌官方旗舰店隐形眼镜伴侣盒美瞳盒子护理盒', '【第2件半价】海昌ClearEasy半年抛1片高清近视透明隐形眼镜', '保险服务'], ['2018秋冬季新款网红微喇九分高腰chic直筒宽松牛仔裤女加绒喇叭裤', '保险服务'], ['muzi 18冬/蓝/碳灰 金色方扣加绒加厚保暖牛仔外套棉服棉衣外套女'], ['时尚美潮宇航员nasa联名卫衣男宽松chic情侣秋冬连帽套头加绒外套', '保险服务'], ['加绒运动裤女学生韩版宽松加厚羊羔绒显瘦休闲卫裤小脚秋冬哈伦裤', '保险服务'], ['手工切片糖果混合水果味少女网红高颜值零食结婚圣诞节CEO2WktXj4', '大白兔奶糖礼盒装批发喜糖果小零食少女心送朋友礼物圣诞节大礼包', '圣诞节千纸鹤糖果磨砂水果硬糖结婚喜庆袋装批发网红少女小零食', '保险服务'], ['英菲克鼠标有线静音无声男女生大USB笔记本家用办公台式电脑光电网吧网咖绝地求生吃鸡宏cf游戏电竞机械lol'], ['学生宿舍床帘上铺下铺物理遮光帘女寝室神器加厚窗帘床幔ins风', '保险服务'], ['oppor15钢化水凝膜r15梦境版全屏覆盖蓝光星云版纳米手机全包边标准版前后0pp0原装无白边防摔刚化9D曲面软膜'], ['自然堂喜马拉雅面膜36片 补水保湿 提亮肤色女官方旗舰店官网正品', '保险服务'], ['【双11狂欢价】【百草味-肉类零食大礼包】猪肉脯猪肉干小香肠 休闲食品网红小吃', '保险服务'], ['2018冬季新款chic棉衣毛领面包服甜美修身百搭短款棉服外套女加厚', 'linjou玲玖2018秋季新品chic学生打底绣花半高领打底针织衫毛衣女'], ['生日礼物女生网红ins走心超火的少女心爆棚送闺蜜同学diy韩国创意'], ['ins高帮小白鞋女原宿百搭厚底帆布鞋2018秋冬韩版运动板鞋学生鞋', '保险服务'], ['高帮帆布鞋女韩版ulzzang潮2018新款学生百搭黑色原宿板鞋ins街拍', '保险服务'], ['chic早秋冬装2018新款女装韩版长袖连帽女刺绣宽松加绒加厚卫衣潮', '卡通刺绣上衣冬装女2018新款韩版宽松圆领长袖套头加绒加厚卫衣潮', 'ins超火的秋冬装女2018新款韩版上衣字母印花套头加绒加厚卫衣潮', '保险服务'], ['直筒牛仔裤女春秋2018新款韩版显瘦冬季加绒加厚高腰黑色宽松学生', '直筒牛仔裤女春秋2018新款韩版显瘦冬季加绒加厚高腰黑色宽松学生', '保险服务'], ['运动裤女秋2018新款韩版学生宽松街拍ulzzang百搭显瘦休闲裤子潮'], ['足球鞋男tf碎钉儿童小学生青少年男童皮足室内成人训练鞋ag长钉女', '保险服务'], ['初秋2018新款韩国原宿风条纹宽松bf上衣学生高领长袖T恤打底衫女', '初秋2018新款韩国原宿风条纹宽松bf上衣学生高领长袖T恤打底衫女', '保险服务'], [], [], [], [], [], [], [], [], [], [], [], [], [], [], [], [], [], [], [], [], [], []]
# unit_price_list = [['19.90'], ['22.10', '32.20'], ['51.00'], ['14.80', '0.00'], ['45.80', '0.00'], ['19.60'], ['34.90'], ['59.00'], ['18.80', '49.90'], ['36.50', '39.80', '29.17', '34.50'], ['139.00', '0.00'], ['46.50', '29.50'], ['0.01'], ['13.88', '32.00', '23.00', '9.90', '16.90'], ['29.80', '79.00'], ['65.80'], ['59.00'], ['13.80', '13.80'], ['43.00', '0.00'], ['30.00'], ['16.90', '32.00', '13.88', '23.00', '9.90'], ['68.00', '0.00'], ['10.00'], ['46.78'], ['36.00'], ['143.00', '0.00'], ['143.00', '0.00'], ['98.00', '0.00'], ['8.00', '10.90'], ['149.90', '0.00'], ['27.90', '0.00'], ['26.00', '0.00'], ['16.92', '0.00'], ['29.60', '0.00'], ['57.60', '0.00'], ['89.00', '0.00', '0.00'], ['49.00', '0.00'], ['89.00', '0.00', '0.00'], ['70.00', '0.00'], ['59.00', '0.00'], ['16.90', '0.00'], ['6.80'], ['79.00', '0.00'], ['159.00', '0.00'], ['38.80'], ['188.00', '0.00'], ['39.90', '0.00'], ['23.90', '9.90'], ['122.00', '0.00'], ['159.00'], ['29.90'], ['78.00', '0.00', '0.00'], ['78.00', '0.00', '0.00'], ['114.00'], ['69.00', '0.00'], ['18.00'], ['1.00'], ['35.90', '0.00'], ['58.00'], ['26.00'], ['15.00'], ['19.80'], ['69.00'], ['39.90'], ['15.99', '0.00'], ['219.00', '0.00'], ['32.90', '14.80', '0.00'], ['20.00'], ['119.00', '169.00'], ['27.00', '15.00'], ['55.00', '0.00'], ['24.60'], ['6.75'], ['20.00'], ['32.80', '49.90', '0.00'], ['37.90', '39.90', '0.00'], ['47.60'], ['128.00'], ['69.00', '0.00'], ['319.00', '0.00'], ['30.00'], ['30.00'], ['238.00'], ['20.00'], ['69.00', '0.00'], ['89.00', '0.00'], ['45.30', '0.00'], ['39.00', '0.00'], ['39.80', '0.00'], ['39.80', '0.00'], ['208.00', '0.00'], ['11.88'], ['35.00', '0.00'], ['11.98'], ['17.80', '0.00'], ['39.80'], ['20.00'], ['35.80', '35.00', '0.00'], ['14.80', '38.80', '0.00'], ['19.90', '0.00'], ['99.00', '99.00', '0.00'], ['48.00'], ['39.90', '0.00'], ['6.29', '0.00'], ['99.00', '0.00'], ['36.00', '0.00', '0.00'], ['79.90', '0.00'], ['69.90', '0.00'], ['69.00', '0.00'], ['79.90'], ['50.00'], ['99.80'], ['29.94'], ['18.66', '17.00', '14.99'], ['99.90', '0.00'], ['49.90'], ['15.70'], ['129.00'], ['65.00', '0.00'], ['34.90', '0.00'], ['78.00'], ['14.90', '0.00'], ['43.00', '43.00', '0.00'], ['639.00'], ['79.00'], ['49.90'], ['46.80', '18.80'], ['29.90'], ['49.98'], ['9.90', '39.90', '0.00'], ['139.99', '0.00'], ['114.90', '0.00'], ['19.96'], ['20.00'], ['19.96'], ['19.96'], ['20.00'], ['19.96'], ['19.96'], ['25.80', '0.00', '0.00'], ['19.96'], ['19.96'], ['17.80'], ['20.00'], ['19.96'], ['44.50'], ['58.00'], ['71.00'], ['19.96'], ['19.96'], ['6.80', '12.80', '6.80'], ['9.80', '11.80'], ['58.00', '0.00'], ['39.80', '0.00'], ['148.00', '0.00'], ['29.94'], ['20.00'], ['139.00', '0.00'], ['39.50', '0.00'], ['19.98'], ['19.96'], ['268.00'], ['39.90', '0.00'], ['22.90', '0.00'], ['19.60', '0.00'], ['17.80', '0.00'], ['20.00'], ['66.00'], ['139.00'], ['159.00', '0.00'], ['39.00', '0.00'], ['22.90', '0.00'], ['369.00'], ['99.98'], ['67.99'], ['99.80'], ['99.80'], ['138.00'], ['35.00', '0.00'], ['29.94'], ['30.00'], ['49.90'], ['21.80', '0.00'], ['24.90', '12.80', '0.00'], ['29.90', '0.00'], ['99.80'], ['99.80'], ['99.80'], ['13.49'], ['30.70'], ['35.00'], ['49.90'], ['48.80', '0.00'], ['99.00', '118.00'], ['39.40'], ['39.90'], ['12.90', '0.00'], ['64.00', '0.00'], ['75.00', '0.00'], ['46.90'], ['108.00', '0.00'], ['151.00'], ['62.00', '0.00'], ['49.90', '0.00'], ['22.80'], ['38.00', '0.00'], ['13.40', '0.00'], ['23.90'], ['66.00', '53.00', '25.00', '66.00', '0.00'], ['79.00', '0.00'], ['109.00'], ['99.00', '0.00'], ['69.00', '0.00'], ['14.80', '19.90', '12.90', '0.00'], ['19.80'], ['28.70', '0.00'], ['19.80'], ['144.00', '0.00'], ['49.90', '0.00'], ['232.20', '128.00'], ['35.00'], ['59.00', '0.00'], ['55.00', '0.00'], ['53.98', '37.98', '41.98', '0.00'], ['59.90', '59.90', '0.00'], ['29.80'], ['59.00', '0.00'], ['9.90', '9.90', '0.00'], [], [], [], [], [], [], [], [], [], [], [], [], [], [], [], [], [], [], [], [], [], []]
# price_list = [['0.01'], ['46.87'], ['51.00'], ['13.80'], ['45.80'], ['18.60'], ['29.21'], ['59.00'], ['68.70'], ['139.97'], ['139.00'], ['76.00'], ['0.01'], ['88.79'], ['108.80'], ['65.80'], ['59.00'], ['33.78'], ['36.71'], ['27.00'], ['93.79'], ['68.00'], ['10.00'], ['46.78'], ['36.00'], ['128.71'], ['128.71'], ['95.06'], ['18.34'], ['108.92'], ['24.90'], ['0.00'], ['10.83'], ['26.25'], ['51.08'], ['127.87'], ['95.06'], ['116.69'], ['48.64'], ['56.82'], ['16.90'], ['5.80'], ['59.00'], ['103.35'], ['36.86'], ['172.36'], ['59.85'], ['33.80'], ['118.34'], ['169.00'], ['0.01'], ['38.00'], ['38.00'], ['109.00'], ['69.00'], ['18.00'], ['1.00'], ['35.90'], ['58.00'], ['24.70'], ['15.00'], ['19.80'], ['68.31'], ['39.90'], ['15.99'], ['219.00'], ['72.30'], ['20.00'], ['288.00'], ['39.00'], ['55.00'], ['24.60'], ['6.75'], ['20.00'], ['72.70'], ['67.80'], ['19.80'], ['119.00'], ['66.93'], ['289.00'], ['30.00'], ['30.00'], ['210.86'], ['20.00'], ['69.00'], ['69.00'], ['45.30'], ['35.00'], ['39.80'], ['39.80'], ['138.00'], ['11.88'], ['33.95'], ['11.98'], ['17.62'], ['37.61'], ['20.00'], ['66.75'], ['53.60'], ['9.90'], ['38.00'], ['44.63'], ['11.93'], ['6.11'], ['91.03'], ['36.00'], ['79.20'], ['28.90'], ['64.00'], ['39.90'], ['50.00'], ['99.80'], ['29.94'], ['47.65'], ['19.90'], ['49.90'], ['15.70'], ['49.00'], ['65.00'], ['34.90'], ['71.44'], ['14.46'], ['45.42'], ['647.00'], ['76.00'], ['49.90'], ['65.60'], ['29.01'], ['49.98'], ['32.42'], ['122.01'], ['103.59'], ['19.96'], ['18.00'], ['19.96'], ['19.96'], ['20.00'], ['19.96'], ['19.96'], ['25.80'], ['19.96'], ['19.96'], ['17.80'], ['20.00'], ['19.96'], ['50.50'], ['56.26'], ['71.00'], ['19.96'], ['19.96'], ['25.08'], ['21.60'], ['51.40'], ['36.80'], ['148.00'], ['29.94'], ['20.00'], ['139.00'], ['39.50'], ['19.98'], ['19.96'], ['268.00'], ['14.90'], ['22.90'], ['18.44'], ['17.80'], ['20.00'], ['66.00'], ['139.00'], ['169.00'], ['39.00'], ['20.90'], ['369.00'], ['99.98'], ['62.99'], ['99.80'], ['99.80'], ['68.00'], ['32.00'], ['29.94'], ['30.00'], ['49.90'], ['21.80'], ['37.70'], ['29.90'], ['99.80'], ['99.80'], ['99.80'], ['13.49'], ['30.70'], ['35.00'], ['49.90'], ['48.80'], ['227.00'], ['39.40'], ['39.90'], ['12.90'], ['64.00'], ['55.00'], ['78.80'], ['108.00'], ['151.00'], ['62.00'], ['49.90'], ['22.80'], ['38.00'], ['13.40'], ['23.90'], ['182.00'], ['79.00'], ['109.00'], ['99.00'], ['69.00'], ['47.60'], ['19.80'], ['57.40'], ['19.80'], ['144.00'], ['49.90'], ['335.20'], ['35.00'], ['59.00'], ['55.00'], ['133.94'], ['119.80'], ['29.80'], ['59.00'], ['4.00'], [], [], [], [], [], [], [], [], [], [], [], [], [], [], [], [], [], [], [], [], [], []]
# num_list = [['1'], ['1', '1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1', '1'], ['1', '1', '1', '1'], ['1'], ['1', '1'], ['1'], ['1', '1', '1', '1', '1'], ['1', '1'], ['1'], ['1'], ['1', '1'], ['1'], ['1'], ['1', '1', '1', '1', '1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1', '1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['2', '1'], ['2'], ['2', '1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['2'], ['1', '1'], ['1'], ['1'], ['1'], ['1', '1', '1'], ['1', '1', '1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1', '3'], ['1'], ['1', '1'], ['1', '1'], ['1'], ['1'], ['1'], ['1'], ['1', '1'], ['1', '1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1', '1'], ['1', '1'], ['1'], ['1', '1'], ['1'], ['1'], ['1'], ['1'], ['1', '1'], ['2'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1', '1', '1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1', '1'], ['1'], ['1'], ['1'], ['1', '1'], ['1'], ['1'], ['1', '1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1', '1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1', '1', '1'], ['1', '1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1', '1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1', '1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1', '1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1', '1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['2'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1'], ['1', '1', '1', '1'], ['1'], ['1'], ['1'], ['1'], ['1', '1', '1'], ['1'], ['2'], ['1'], ['1'], ['1'], ['1', '1'], ['1'], ['1'], ['1'], ['1', '1', '1'], ['1', '1'], ['1'], ['1'], ['1', '1'], [], [], [], [], [], [], [], [], [], [], [], [], [], [], [], [], [], [], [], [], [], []]
#
# with open('taobao.csv', 'a', encoding='utf-8') as f:
#     writer = csv.writer(f)
#     writer.writerow(["title", "price", "num", 'total_price'])
#     for i in range(0, len(price_list)):
#         if price_list[i] == []:
#             break
#         else:
#             for j in range(0, len(unit_price_list[i])):
#                 if title_list[i][j] == '保险服务':
#                     continue
#                 else:
#                     writer.writerow([title_list[i][j], unit_price_list[i][j], num_list[i][j]])
#             writer.writerow([' ', ' ', ' ', price_list[i][0]])

